#1.1索引

a ="helloworld"
print(a[0])
print(a[1])
# a[0]值为h    a[1]值为e

print(a[-1])
print(a[-2])
# a[-1]值为d   a[-2]值为l


#1.2分片
print(a[1:5])
#从索引1开始到索引5之前，不包括索引5，返回值ello
print(a[5:-2])
#返回值wor
print(a[5::-2])
#从索引5开始往前，步长为2，返回值wle
b="0123456789"
print(b[4::-2])
#返回值420
print(b[4::2])
#返回值468


# 1.3 序列相加
x=[1,3,5]
y=[2,4,6]
print(x+y)
#返回值是[1,3,5,2,4,6]
#"+"是把两个序列相连，string不能和数字相连


# 1.4 乘法
a=[1,3,5]
b=[2,4,6]
c=4
print(a*c)
#返回值[1,3,5,1,3,5,1,3,5,1,3,5]
#"*"是把列表复制，列表和列表不能相乘，a和b不能相乘


# 1.5 成员资格
a=[1,2,3,4,5,6,7,8,9]
print(1 in a)
#返回值true
print(10 in a)
#返回值false